[{"Post": "", "json_obj": {"Scott Sterling": {"text": "Remember when Democrats didn't give a shit about DAPL and used the same horrible oppressive tactics to abuse the protesters?  I'm sure they'll be able to fix everything."}, "Dylan Harrison": {"text": "This is why America needs a new party. Republicans and Democrats don't care.", "reply": {"Kathryn Lambkin": {"reply_text": "Dylan Harrison needs a whole new political system even..."}, "Tony Murphy": {"reply_text": "One party"}, "Léal Les Baux": {"reply_text": "*a new system, not just political"}, "Sean Benish": {"reply_text": "Dylan Harrison  nope sry yes you will get some corruption but nowhere near where it is now, you have career politicians right now that work together to play the system during term limits you won’t be able to take years to play the system, to many good …See More"}, "Dylan Harrison": {"reply_text": "Sean Benish then go make it happen if you got it all figured out. You need way more than that. No amount of repeating yourself is going to convince me you got it all figured out. I know for a fact term limits isn't enough nor will it ever be. It will h…See More"}, "Tim Mullany": {"reply_text": "Dylan Harrison sorry, won’t happy since Nader ALLLLLLMOST showed reg schlubs behind the curtain. They put an end to that real quick after that."}, "Lucas Larson": {"reply_text": "There is a massive propaganda machine supported by big money that controls the major news outlets and what's taught in school and everything. It's stacked against us. We must organize a third party but it must be revolutionary so that money doesn't just continue to control everything. Even thomas jefferson said the country would one day fall to banks and money lenders"}, "Ryan Strawsma": {"reply_text": "Americans don't care, hate to say it"}}}, "Radu Vartolomei": {"text": "same in europe with the social democrats and liberal(in europe liberalism is something different then american liberalism)! Probably this is why  populism is growing. populists at least pretend they care."}, "Eden Standing": {"text": "Republicans: If we lose the election we are starting an apocalypseDemocrats: Our apocalypse has CELEBRITIES."}, "Roman Holsteros": {"text": "THAT'S how you nutsell"}, "Alfred Jones": {"text": "The Dems use lube when they fuck you over", "reply": {"Michael Cooke": {"reply_text": "Chris Conkle let me use another allegory to clarify: if we were on fire, the repubs wouldn't do shit. The dems, on the other hand, would definitely piss on us to put it out. Then they'd belittle us for smelling like piss and being dirty, while charging us a fee for putting out the fire."}, "Chris Conkle": {"reply_text": "Michael Cooke I don't disagree at all on the original analogy or newer.  We just picked differing vile means of getting our respective issues resolved (Flint water for lube, red tape of bureaucracy to put out fire). I guess my discontent is directed more toward the 3PC alternative not being viable.  …See More"}}}, "Esther De Bie": {"text": "True!"}, "Luka I'Dell": {}, "Nikki Woodworth": {}, "Robin Jonker": {"text": "Why USA have only two parties? This is a dictatorship like China but with 2 parties than 1."}, "Veronica Saad": {"text": "Roy Khouri"}, "Mattia Musiello": {"text": "With emoticones all ting is better 🤣🖕😃😉❤️😘🖕"}, "Sarah Roller": {"text": "George Billinge"}, "Jonathon Campbell": {"text": "Cathal McCaffrey", "reply": {"Cathal McCaffrey": {"reply_text": "L I T E R A L L Y"}}}, "Gaute Rosvold": {"text": "Johannes Gartland"}, "Tom Harvey": {"text": "Carlos Marques Pestana"}, "Ed Green": {"text": "Billy Roberts"}, "Henry Chapton": {"text": "Elle Walters isn’t this something"}, "Holly Sh": {"text": "Liv A Little"}, "Ananya Nair": {"text": "Arkopriya Pal", "reply": {"Arkopriya Pal": {"reply_text": "Ananya Nair honestly biggest takeaway from 13th"}}}, "Fiorella Paludi": {"text": "Alessandro"}, "Gard Kristian Jørgensson Moneta-Bosoni": {"text": "Roy Halley"}, "Joe Lawler": {"text": "Lewis Fowden"}, "Sylvia Pompe": {"text": "Adrien Edern", "reply": {"Adrien Edern": {"reply_text": "😘😘"}}}, "Asmae Yadaoui": {"text": "Mehdi El Houri", "reply": {"Mehdi El Houri": {"reply_text": "Asmae Yadaoui at least Republicans kay3awno l Working Class yb9aw khddamin w mayglsoch ybetlo ktr mn Democrats"}}}, "Lærke Papsø": {"text": "Signe", "reply": {"Signe Regitze Hansen": {"reply_text": "Lærke Papsø sjovt, men også ret trist"}}}, "Hermona Kuluberhan": {"text": "Alex Neufeldt", "reply": {"Alex Neufeldt": {}}}, "Isabel de Leon": {"text": "Lionel Schor"}, "Yasmina Aspinall": {"text": "Serena Aspinall", "reply": {"Serena Aspinall": {"reply_text": "Yasmina Aspinall lmaoooo"}}}, "David Gerstacker": {"text": "Filmon Tezare"}, "Kyle Guzman": {"text": "Alexis Brandon"}, "Chris Flannigan": {"text": "Aaron Reddick"}, "Maxi Krennbauer": {"text": "Thomas McIlhatton"}, "Habib Azzoug": {"text": "Riad"}, "Emma Pereira Hay": {"text": "Mathias Hedegaard Thomsen", "reply": {"Mathias Hedegaard Thomsen": {"reply_text": "this slaps"}}}, "Craig Stout": {"text": "Rory Neilson"}, "Kiona Derix": {"text": "Anne Reijnders 💔"}, "Tim Buisman": {"text": "Aiya Bakip", "reply": {"Aiya Baki": {"reply_text": "bakip"}, "Tim Buisman": {"reply_text": "Aiya Baki yeah oops that was a mistake but funny"}}}, "Aya Bouzidi": {"text": "Salma Dehbi"}, "Pedro H. Angoti": {"text": "Léo Chacel"}, "Andreas Bayer Vegeberg": {"text": "Felix Jeppe Fatum hehe"}, "Loïck Merle": {"text": "Emeline Andjerakian jpp"}, "Lasse Lewin": {"text": "Dominik D. Huch aua 😂😂", "reply": {"Dominik D. Huch": {"reply_text": "Lasse Lewin uff"}, "Lasse Lewin": {"reply_text": "Dominik D. Huch uuuuuuufff 😂"}}}, "Jonas Emrich": {"text": "Fabi Stg"}, "Michael Sandford": {"text": "Ellen Harvey"}, "Charlie Raiteri": {"text": "Samuel Keating"}, "Dino Mite": {"text": "https://www.youtube.com/watch?v=ULYWIDcUOY4&t"}, "Sean Benish": {}, "Cain Smyth": {"text": "Newton Geiszler Isaac Greene Rosana Madrid", "reply": {"Isaac Greene": {"reply_text": "Nobody gives a shit about us"}, "Cain Smyth": {"reply_text": "Isaac Greene No but with 40 MM smoke GRENADES?"}}}, "Leonardo Kamper": {"text": "Manuel Pontón Juan Sebastián Restrepo"}, "Corey James": {"text": "Ryan Tierney"}, "Gareth Thomas": {"text": "Rob Jones 😂"}, "Alexander Chen": {"text": "Shaunak Sarker Karl Henrik Smith Kristian Olsen Kai Zhang", "reply": {"Karl Henrik Smith": {"reply_text": "More trade means less poverty"}}}, "Jamie Verhelst": {"text": "Toon Merckx"}}}, {"Post": "Video advertising is easier than ever.", "json_obj": {"Jennifer Farmer-Knowles": {"text": "with a THOUSAND dollar minimum!", "reply": {"Kyle Fawkes": {"reply_text": "While this page is a scam, that's actually a fairly reasonable amount for advertising."}}}, "Brett Wilson": {"text": "I dont want to see this"}, "Reginald Guitaro Guillaume": {"text": "If Obama was a girl."}, "Mahbod Moghadam": {"text": "is it possible to advertise on \"Behind the Lyrics\"? that's my favorite feature on spotify"}, "Maddd Masks": {"text": "Great!! 🤟👏👌"}, "Emerson Wenzel": {"text": "Sam Shaw ads 😌"}, "Hazael RV": {"text": "cool program!"}, "Zubair Khan": {"text": "Anhar Mac Karim"}, "Skylar Cowden": {"text": "❤️🙌🙏"}, "Jesus Berry": {"text": "Lol."}, "Mollie Brower": {"text": "for a moment I thought the text read, \"self-love\", and I was like awe that's nice. 😅 but nope"}, "Randy Zejdlik": {"text": "OK"}, "The Ghastly Head of Gary Sharpi-o": {"text": "#FuckAds"}, "Troy Gossman": {"text": "Video ads will make me quit using Spotify. If they're already there, then they're being blocked."}, "AI Sroda": {"text": "#Blockingmen StarSeeds members only"}, "Miakoda Celena Combies": {"text": "Ok, being subjected to audio on ads when trying to be quiet makes me HATE a company"}, "Brian Harris": {"text": "Aw, So Long, So LymmetrySo Tack in the Back"}, "Shaolin Dave McAlias": {"text": "Did Barack Obama dress up as Olive Ole for Halloween?"}, "Valery Cass": {"text": "Just piss off more people with your spammy crap."}, "Corey Smith": {"text": "bund unaccepted due due do    all"}, "Parker Helms": {"text": "This is great"}, "Dave Ridings": {"text": "Mark Zuckerberg......StopHateForProfit. boycott FB advertising"}, "Mo Mohamed": {"text": "https://www.doordash.com/.../Mohamed-Abusnina-5786/..."}, "David Schwartz": {"text": "https://www.stophateforprofit.orgGreat idea and organization but doesn’t go far enough. Here is how you can help: boycott Facebook advertisers. I am boycotting Facebook advertisers and I urge others to until Facebook stops helping to spread hate, dangerous misinformation, and lies. I suggest your organization reconsider how it currently spends its ad budget."}, "Niall Macaulay": {"text": "Piss off Spotify. you don't pay artists well enough, and you are still making a loss... bad business."}, "Jeff Bryce": {"text": "No one wants sound-on video ads for a music service you absolute clowns."}, "Kelly Grant": {}, "Rich Bottles Jr.": {}, "Bob Ureey": {}, "Cari Rotoli": {"text": "Please don’t advertise on Facebook for the month of July. This campaign has hundreds of companies who have already agreed to do the same, even big companies like Microsoft, Best Buy, and Verizon. The campaign is organized by the NAACP, ADL and others a…See More"}, "Rich Ficken": {"text": "FREE RIGHT?"}, "Andy Bower": {"text": "https://open.spotify.com/artist/2Uazfy8E66ZnAOQU7rJWdJ"}, "David Giron": {"text": "https://youtu.be/wr_DOURU7eQ"}, "M.e. Byrne": {"text": "Please consider participating in the #StopHateforProfit campaign taking place this July. Despite repeated requests from civil rights organizations, Facebook has not taken steps to build a civil rights infrastructure, to prioritize the safety of users, …See More"}, "Jonathan Rough": {"text": "https://youtu.be/TYLZQge3kDE"}, "Kyle Fawkes": {}, "Jake Numedahl": {"text": "www.facebook.com/groups/290506022231110/"}, "Pfunandre Redvict": {"text": "GoodNews256.com  Praise Jesus !!!"}, "Philip J Pugh": {"text": "trump is a known pedophile.."}, "Pa Ogilvy": {}, "Kyle Coghlan": {"text": "meh..im rocking out FB and IG ads, much bigger and cheaper reach"}, "Dan Chapman": {"text": "mmmm I love ads https://stockconsultant.com/"}, "Amanda Gonzalez": {"text": "#JusticeforVanessaGuillen"}, "Kyle Ylitalo": {"text": "I made 17 sales today using massiveclicks.com"}, "Alicia Paulina": {"text": "Hello Friend's...Im share my problem; Last few month im mentaly depression & my Blood Presser High etc symptoms sick for COVID-19 Coronavirus subject.After that my Doctor give me Organifi Green Juice. This super food give me incredible Energy, Boostin…See More"}, "John Koman": {"text": "Sponsored Ad:  Or -Gan-Tic!  Whitedovesfarmfresh.com Bookmark us for September fruit flush out!"}, "Jack Miller": {"text": "keep yer UNSOLICITED CRAP SPAM on yer OWN page *ssholes"}}}, {"Post": "The history of the people of Europe has not ended - it never will. Ethnogenesis is a process of the present and future as much as it is the past. No efforts of romantics, politicians, or social scientists can preserve once and for all some essential soul of a people or nation. - Patrick J. Geary Map: u/Alonieco", "json_obj": {"Seán Ó Maoilriain": {"text": "The map of Ireland is incorrect, Irish, while not the majority language in all parts of the island, is still spoken on the entire island.I don't live in the white part, I live in the red and I speak Irish. There are a lot of Irish speakers in the red part!"}, "Marc Saindon": {"text": "to be fair, no one lived on Iceland before the vikings, although they themselves claim the presence of previous irish monks (\"papars\") of which there are no trace, and also elves (same)."}, "Clèireach Mac an Aba": {"text": "That map is being really generous as far as modern Celtic languages go. :(", "reply": {"Jason Bitkower": {"reply_text": "Clèireach Mac an Aba I think a lot of the white part in the 500 bce map was mainly Celtic, no? Indeed seems like a big hole in the analysis."}, "Zimer Nesimi": {"reply_text": "Clèireach Mac an Aba The map indirectly shows where this languages was used and with their expansion(extermination, assimilation of other nations and their languages) these three languages destroyed hundreds of nations and languages all over Europe (Ru…See More"}, "Keith Galbraith": {"reply_text": "Very much so Clèireach"}, "Clèireach Mac an Aba": {"reply_text": "Yeah I get that. I am saying its \"indirectly\" suggesting that modern celtic languages (Gaelige and Gaidhlig in particular) have a bigger geographic area of usage than they actually do."}}}, "Lukáš Kuchta": {"text": "I think we can talk about Slavic dialect continuum when imagining slavic opopulated area towards 1000 AD. 500BC is an era of proto slavic language."}, "Ed Zachary": {"text": "imagine if the indoeuropeans never developed the ability to digest milk into adulthood", "reply": {"Jordan Matthew Hurley": {"reply_text": "Ed Zachary  well this Indo-European descendant is glad they did"}}}, "Jordan Matthew Hurley": {"text": "Where’s the Celtics?", "reply": {"Mark Singer": {"reply_text": "In Boston."}, "Michael Dale": {"reply_text": "The only correct answer of course /s"}, "Jordan Matthew Hurley": {"reply_text": "Mark Singer  that’s not what I asked."}}}, "Kane Carmichael": {"text": "i wonder how they decided where to place slavic? proto-slavic and proto-balto-slavic are notoriously hard to place that far back. here's a video on it. https://www.youtube.com/watch?v=eLrMjNtAy8M tldr the veneti probably werent the precursors of the slaves but some closely related indo-european group whose name and material culture was adopted by slavic migrants that moved westward into the area", "reply": {"Kane Carmichael": {"reply_text": "a favourite line of mine from the video \"people have sex with anyone/ you cant stop people having sex\" basically that peoples commingled with one another, so youd have exclaves of groups dotted through border regions away from the cultural cores."}}}, "Kathryn Camilleri": {"text": "I \"love\" how when it comes to Europe you've called it \"Ethnogenesis\" when what these maps clearly depict is histories of colonization of the tribal peoples of Europe. This is really annoying.", "reply": {"Wallace Sparks": {"reply_text": "Kathryn Camilleri I find equating it with modern colonialism to be very ignorant and offensive."}, "Kathryn Camilleri": {"reply_text": "Wallace Sparks I'm a PhD in Anthropology with a speciality in Europe/Britain. So I'm fairly conversant in the topic. And these maps do not show Indo-European language expansion. You are also mistaken about gene flow across Europe and in Britain in particular."}, "Simon Ankarstrand": {"reply_text": "I’m the queen of England and waving titles means little if you display this level of ignorance of the subject.If the American colonists would have been subjugated by the natives, gradually integrating the various cultures to form a new identity based…See More"}, "Mark Singer": {"reply_text": "Wallace Sparks Persistence of British DNA and the spread of Indo-European languages represent processes that occurred during vastly different periods, so I do think putting them next to each other is more confusing than instructive. As far as \"contribution…See More"}}}, "Anabella Dawn": {"text": "Don’t forget Hausa, Yoruba, and Igbo in Ireland 🙄", "reply": {"Jordan Matthew Hurley": {"reply_text": "Anabella Dawn  there is none"}}}, "Mark Araujo": {"text": "Spanish & Portuguese also have thousands of arabic words not used in any of the other italic languages. French & Italian also have Germanic words that don't exist in the Portuguese or Spanish languages. The invasions & dominance of different ethnic gro…See More", "reply": {"Pepper Birde": {"reply_text": "Respecting of others spaces is culturally learned, anglos fucked us all and convinced us it's just human nature."}, "Kathryn Camilleri": {"reply_text": "I would hypothesis that what these maps are showing are waves of colonization starting with the Roman empire (which had vast tracts of the red bits), which destroyed tribal Europe and set a precedent for cultures of colonization."}}}, "Tony Masiuk": {"text": "Slavic, Italic, and Germanic languages aren't the only language groups of Europe. Also Celtic, Hellenic, Finno-Ugric, Albanian, and Basque. And, the Baltic languages which are actually part of a Balto-Slavic group.", "reply": {"Darrell E. Manrique": {"reply_text": "No one claimed they were. They do seem to be the most widespread today, though, going solely by this map."}}}, "Santo Ienno": {"text": "What exactly do the map makers imagine was being spoken 500 bc in the white part of the map?. No clue about Arab, egyptian, Greek, phenician..", "reply": {"Mik Sutton": {"reply_text": "Thracian, Illyrian, \"Celtic\" languages, Basque, Etruscan, hundreds of languages we'll never know about... panta rhei!"}, "Sébastien Boillat": {"reply_text": "Good question ! Language diversity must have been much higher in 500 bc ... languages go extinct with time but new languages emerge too"}}}, "Valentin Piee": {"text": "Slavs originated from today Belarus"}, "Zimer Nesimi": {"text": "The spread of these languages was destructive for once multilingual, multinational Europe. In fact these languages don't exist, these are more dialects in these three languages groups.", "reply": {"Kathryn Camilleri": {"reply_text": "That's exactly what the map legend says."}, "Valentin Piee": {"reply_text": "No way,"}}}}}, {"Post": "RNC Night 2: First Lady Melania Trump, Secretary of State Mike Pompeo and Eric Trump will speak on the second night of the Republican National Convention. Watch the speeches live.", "json_obj": ""}, {"Post": "Plants are integral to reweaving the connection between land and people. A place becomes a home when it sustains you, when it feeds you in body as well as spirit. To recreate a home, the plants must also return...  To be native to a place we must learn to speak its language...  With words at your disposal, you can see more clearly. Finding the words is another step in learning to see...  I remember the words of Bill Tall Bull, a Cheyenne elder. As a young person, I spoke to him with a heavy heart, lamenting that I had no native language with which to speak to the plants and the places that I love. “They love to hear the old language,” he said, “it’s true.” “But,” he said, with fingers on his lips, “You don’t have to speak it here.” “If you speak it here,” he said, patting his chest, “They will hear you.” - Robin Wall Kimmerer (Potawatomi) It's wild rice season in the Great Lakes! What are some traditional foods where you live? What are their Indigenous names?", "json_obj": {"Jacinto Zulueta": {"text": "Hawaii La'au Aweoweo. Plant. Smells like fish. It's related to amaranth, looks similar to \"lambs quarters\" on turtle island area."}, "Mike Gusev": {"text": "i was just reading about the Ojibwe and their connection to wild rice on wikipedia yesterday. the story goes that they lived on the east coast (in the \"land of the dawn\") until they were told by the great spirit to travel west until they found \"food that grows on water\". when they saw the wild rice growing on the southern bank of now-lake superior, they settled there."}, "Bruce Tutcher": {"text": "While many look like they come from the same root (Algonquin it seems) the others are intriguing. Ho Chunk,  Dakota, Chiwere and Ohama-Ponca are \"Siouan\",  with some similarity in thier first syllables. Very cool."}, "Elliot Gonzales": {"text": "I love this page"}, "M Michael Murphy": {"text": "Love that the background map is oriented with East up, very cool"}, "Gary Fuller": {"text": "Tammy L Whitebeaver Anderson"}, "José Marcelo Galvez Donoso": {"text": "In our andean region, we have the potato, whose name in quechua is a simple and beautiful \"papa\", which in english would be pronounced something like \"pah-pa\"", "reply": {"Wallace Sparks": {"reply_text": "José Marcelo Galvez Donoso so wait does the Latin American Spanish word for potatoes, papas, come from Quechua?"}, "Darío Cantú Quintanilla": {"reply_text": "Wallace Sparks yes, and the word potato in English also comes from another indigenous language"}, "José Marcelo Galvez Donoso": {"reply_text": "It does. We have plenty of quechua and aymara voices in spanish in the andean region of South America. I live in chilean territory. Say for instance one of the mainly used words for \"arse\" is \"poto\", which is quechua, so is \"guagua\" (baby), also present in mapuzugun (mapuche language, indigenous people in the chilean territory)and many more"}, "Bruce Tutcher": {"reply_text": "Darío Cantú Quintanilla Taino, from what I've read. That makes sense too as it was the first language Columbus came across. Aside from potato, Taino was the source of hurricaine and barbeque!"}}}, "Anthony Barela": {"text": "Marlo Maranda Jeremy 🌾🌾🌾", "reply": {"Jeremy Parson": {"reply_text": "manoomin"}}}, "Khara Danielle": {"text": "Mahnomen ❤️🌾❤️"}, "Gabriele Iuzzolino": {"text": "Are you aPotawatomi?", "reply": {"Bruce Tutcher": {"reply_text": "An exonym, given to them by others. Evidently the Potawatomi call themselves Neshnabé, a cognate of the word Anishinaabe, the endonym/autonym in use (from what I read) among the Odawa, Saulteaux, Ojibwe and some other Algonquin speakers."}, "Istiibin Bellanger": {"reply_text": "Bruce Tutcher The term Potawatomi is their nations name. Neshnabé is the larger people group which includes Ojibwe, Odawa and Omamiwininiwak. Potawotami means Fire Tender or Fire Keeper because in the Three Fires Confederacy they were the keepers of the fire."}}}, "Viktor Thorson": {"text": "i live in Kanien'keha/Mohawk territory, and a preliminary glance seems to indicate the Kanien'keha'ka word for 'rice' is \"onatsakén:rat\". source: https://kanienkeha.net/plants/vegetables/onatsakenrat/", "reply": {"Bruce Tutcher": {"reply_text": "I see. A different language group! :-)"}, "Darrell E. Manrique": {"reply_text": "Viktor Thorson I think it's more common in the western part of the Great Lakes (but I'm not sure)"}, "Viktor Thorson": {"reply_text": "Darrell E. Manrique true but i couldn't find 'wild rice' in that database at least"}}}, "Darrell E. Manrique": {"text": "If you want to try this food (it has a really interesting flavor!) and also support an indigenous business, you can buy it on line:https://nativeharvest.com/products/manoomin-wild-rice..."}}}, {"Post": "Sitting in front of the Crossroads Poat Office. I would hula hoop... Indivisible Eastside (WA)", "json_obj": {"Herb Jaroldine": {"text": "Be safe!"}, "Aletha Ie": {"text": "Who is this?   Is it you?"}, "Lisa R. Weber": {"text": "Yes and my daughter"}, "Kristin Gulley": {"text": "Send me a postcard while you're there!😁💕"}, "Melissa Mercado-Denke": {"text": "With a mask on I could almost believe Amy was you!"}, "Siarah Penter": {"text": "Trump ain’t bad I don’t know what news y’all watch but trump is literally doing eveything he can to keep us safe. It’s damn Biden that is doing all this shit bc he is a democrat he is far far left. Thank you", "reply": {"Lisa R. Weber": {"reply_text": "Siarah Penter as a debate coach we ask students to do their fact checks from reputable sources. You should always be able to back up your facts with 3 reputable sources. Fox news is not accepted as a reputable news source. Their mission statement says …See More"}, "Siarah Penter": {"reply_text": "John Elsbree  And all of you punk asses can’t even answer any of my damn questions so there for you don’t know shit. Also trump even donates his money."}, "Kristina Mercado Kaeding": {"reply_text": "Siarah Penter Why would anyone watch FOX? It is pure right-wing propaganda. There is no \"news\" on that station."}, "John Elsbree": {"reply_text": "Siarah Penter \"I said she was a senator and presidency for 8 yeas\"What the hell does that (\"and presidency\") even mean? She was a Senator for 8 years.…See More"}, "Doug Hightower": {"reply_text": "Siarah Penter Watch FOX? BWAWAWAHAHAHAHA! 🤣"}, "Buchanan Cheryl": {"reply_text": "Siarah Penter I'm readying these replys back and fourth.  Im appalled at the way you are taking to elders.. Its one thing getting your point across but it's another being disrespectful to people.. look up your facts make your point speak your mind , but do it with respect..Love"}}}, "Mathew Almershed": {"text": "Just remember it is not the leftest country"}, "Tracy Underwood": {"text": "Way to go Lisa, I’m in Canada - And can see the atrocities he’s done.  He has made a mockery of the Whitehouse and is a deep core racist and bigot... Dump trump... the death of all the states huge Covid losses is on him, he could have done something sooner.  Now his wall he tried to build, is between Canada and USA...."}, "Doug Hightower": {"text": "FOX News has never won (or been nominated) for a Pulitzer or a Peabody Award the highest honor in journalism. FOX is infotainment."}}}, {"Post": "Remove development bottlenecks, long-winded feature branches, and speed development.", "json_obj": ""}, {"Post": "TIM ALLEN - ON TRUMP ... Whatever your feelings for Trump, these are some interesting points that Tim Allen makes. Put your hatred aside and think about these observations. Tim Allen is credited with writing this. From :Tim Allen...", "json_obj": {"Oliver Peschel": {"text": "1st he didn't write it, please at least spend a second fact checking stuff.2nd if he did we'd know he's back on the cocaine 😂", "reply": {"Colleen Summers": {"reply_text": "Oliver Peschel SO WHAT?  It’s all true"}}}, "Tobias Spruill - Lewis": {"text": "Not one comment by “Tim Allen” above refers to any good thing Trump has said or done as President. This just talks about Hillary, Obama and others ...", "reply": {"Sherry Peter": {"reply_text": "Here is a list of things Trump has done. The news doesn’t talk about them.   https://m.facebook.com/gerald.naples/posts/4189333451138164"}}}, "Kevin Floth": {"text": "Tim’s yard"}, "Ashley Beveridge": {}, "Colleen Parris": {"text": "Fake news", "reply": {"Colleen Parris": {"reply_text": "Lee Baldyga  you too!"}, "Lee Baldyga": {"reply_text": "Colleen Parris  Trump 2020"}}}, "Lee Bedell": {"text": "I wrote it. I didn’t mean it"}, "Linda Clarke": {"text": "Admins should remove this post.", "reply": {"Paul Hutton": {"reply_text": "Excellent Article.  Such a shame you can't stand to read the truth."}}}, "Joni Duzsik Baily": {"text": "What a bunch of BS."}, "Nancy Kennison": {"text": "Bs"}, "Lynita Jene Harris": {"text": "Didn't he used to sell coke was caught and snitched his way out... hmm."}, "Jeffrey Knight": {"text": "What's the coke head up to now?  If he were black, he'd still be in prison for all the blow he got caught with"}, "Anamaria Guerzon": {"text": "Anamaria Guerzon", "reply": {"Anamaria Guerzon": {"reply_text": "Anamaria Guerzon"}}}, "Jim Collins": {"text": "Would love to see the counter opinions to each point"}, "Trinity Cook": {"text": "https://amp.usatoday.com/amp/5269047002", "reply": {"Trinity Cook": {"reply_text": "wrong tim allen"}}}, "Maureen Kiely": {"text": "He sounds mentally ill"}}}, {"Post": "The world’s largest living animal has been spotted off the coast of Sydney! 🐋😲 Sean says he was speechless after capturing vision of a blue whale off Maroubra this week. The species is said to have only been sighted twice off the coast of Sydney in over a decade. 📹 IG: seansperception", "json_obj": {"Kate Fitzgerald": {"text": "Amazing!!! Love the whales,dolphins& seals that have been popping up over Sydney lately", "reply": {"Ken Mugford": {"reply_text": "Kate Fitzgerald seals are yummy and they make good winter apparel"}}}, "Joy Fisher": {"text": "Totally in awe of this magnificent creature not only in the fact that it has survived the wrath of man ( thus far ) but also in the sheer majesty it exudes while navigating its ocean home😍", "reply": {"Barbara Babs Pope": {"reply_text": "Joy Fisher <3 Keep safe, my beauty <3"}}}, "Yozi Prasnikar": {"text": "i I got  so  distinguished feeling  when  i I see  that  loving  beings  . pure  love  and  divine  i I see  in  them  ,  so  special  it  makes  me  sad  that  most  humans  just  dont  get  it  ."}, "Kenneth Fox": {"text": "One of nature's spectacular creatures, and a great clip of something we need to protect."}, "DonandLoretta Vanderbilt": {"text": "It is breathtaking to see a beautiful mammal . We need to protect our oceans from humanity so our children and there children will be able to see this majestic beauty and many more . Texas"}, "Cheryl Cox": {"text": "Such a beautiful creature! We must keep them safe from humanity!"}, "Connie Pembery": {"text": "Just amazing , must have been a wonderful sight, to see this for real is an unforgettable memory ! 🤔🤔👏"}, "Pam Harris": {"text": "Wow that's just incredible. We must care for our oceans and environment"}, "Terri Evans": {"text": "How beautiful and how amazing to see it. We are so lucky to share our planet with do many wonderful creatures. Lets keep them with us and protect the world we live in"}, "Belinda Hall": {"text": "That is amazing, what a wonderful sight.  Hopefully we get more and more of them."}, "Louise Foulds": {"text": "Majestic creatures of our world are simply amazing. We need to protect our oceans and all of it's creatures."}, "Natalie Barger": {"text": "My son, Roy Barger loved stories about blue whales and enjoyed seeing whales at Sea World in Ohio with brother. Russ Baatz"}}}, {"Post": "Colleges across the U.S. are suspending newly returned students who violate coronavirus safety rules.", "json_obj": {"Eric Carlson": {"text": "um, goodput others including faculty, staff, janitors, food service workers, fellow students at risk so they can \"party hearty\"", "reply": {"Drina Duryea": {"reply_text": "Eric Carlson and all of the families they go home to"}}}, "Laurie Aaland": {"text": "This is hard, They're at the age when they feel indestructible and socializing is their life.", "reply": {"Jimmy Burkard": {"reply_text": "Yet responsibility is their goal."}, "Dominick DiMartino": {"reply_text": "Laurie Aaland sorry, not a lot of sympathy. This situation stinks for us all. They are old enough to be living away, on their own, so they should be old enough to understand the stakes are high. No passes; these aren’t babies."}, "Susan Baldwin": {"reply_text": "I wish they had had consistent guidance and modeling of what is expected of them: mask-wearing and distancing was not mandated and is actively ignored by some and in some places."}, "Patsy Nicosia": {"reply_text": "Too bad. Time to adult. Maybe because they paid for it themselves, my girls took college seriously."}, "Brett A. Singer": {"reply_text": "I feel for them but it's for the greater good."}, "Monica Heltemes": {"reply_text": "Susan Baldwin totally! College  towns in Iowa are trying to create an island from the rest of Iowa!"}, "Darby Penney": {"reply_text": "Laurie Aaland , too bad."}, "Kristin Leete": {"reply_text": "Yeah, their brains aren't done forming yet. Scientists have compared brain scans from people of various ages, and found that the part of the brain that governs judgement is not fully formed and functioning until age 22"}, "Victoria Burke": {"reply_text": "Laurie Aaland, indeed. Probably better not to open the campus."}, "Michelle Larabee": {"reply_text": "Laurie Aaland some students have to learn the hard way 😏"}}}, "Anna Catherine": {"text": "Imagine if leadership at every level had made, and enforced, similar guidelines from the start. We wouldn’t be in this perilous spot now."}, "Christine Panisse": {"text": "Selfishness and thoughtlessness. I hope they don't lose a family member or a loved one to covid"}, "Dawn Marie": {"text": "And all their parents will sue the schools"}, "Katherine Anders": {"text": "Great. So 'adult' students can't behave properly, and the government expects us teachers to manage full classloads of actual children."}, "Susan Lena": {"text": "Really exactly why this is a big big mistake to bring these young adults back to campuses.Their normal MO is a feeling of invincibility as it is.…See More"}, "Elise Holzheimer": {"text": "Students had April, May, June and July to learn wear a mask, wash your hands and social distance.  4 months later, you’ve learned nothing?Students will end up sick, suspended or back at home."}, "Cynthia Mancione": {"text": "So, they got their tuition, and are acting surprised this is happening, when they knew it would all along. No one knows better what knuckleheads college kids can be than college administrators . It’s all about the bucks, folks. Don’t think for a minute it isn’t."}, "Linda Wilson": {"text": "Good. As they should. The schools invited them back to school — not to party unregulated.  The students needed to be mature enough to moderate their own behavior which most failed to do. I don’t feel bad. They are putting others at risk as well as dela…See More"}, "Ali van den Broek": {"text": "I hope they get to keep the tuition those \"kids\" parents' have paid.  Lessons to be learned by the under 50's."}}}, {"Post": "GILLES DELEUZE AND SOCIAL CHANGE Being someone deeply involved in social research and social reform works in a country with one of the most complex and fragile ...situations in the region, any reading is best rewarded if it can be practically applied. And      I honestly believe that Gilles Deleuze is best situated for rethinking the social issues one is hoping to change.  In Anti-Oedipus and A Thousand Plateaus, Deleuze, together with Félix Guattari, moved beyond philosophical critique to creation and affirmation of new forms of thought and life, providing a rich source of concepts for re-thinking the social world. In their last collaborated work, 'What is Philosophy?', Deleuze and Guattari shift their focus back to philosophy and its role in effecting revolutionary social change. For Deleuze and Guattari, the aim of philosophy is the creation of concepts which enable something new to be thought or felt. Such concepts have the power, when inserted into concrete fields or assemblages, to produce a change in that field; a change which may in turn lead to other, potentially revolutionary changes. Philosophical theory, in a sense, is not something with which to understand the social, nor is it something which is to be proven true or false. The question is not whether a particular concept is 'true', but whether it works, and whether it opens up the range of possibilities in a given situation. I believe that Gilles Deleuze can inspire in us a general openness to encounters that shift the ground from under us and disrupt established ways of being: encounters that call forth a social yet to come . . .", "json_obj": ""}, {"Post": "Beautiful 🍒 2017 Honda CB500X motorcycle for Sale. $4000 OBO. Like New, runs great, title in hand & no issues, just don’t need it anymore! Make me an offer!", "json_obj": {"Melissa Kate Mason": {"text": "Jennifer Greer you know anyone looking for a bike?", "reply": {"Jennifer Greer": {"reply_text": "Melissa Kate Mason  I’ll ask the hubby!"}}}, "Vickie McQueen-Mason": {"text": "Great pics Melissa Kate Mason"}}}, {"Post": "Beautiful 🍒 2017 Honda CB500X motorcycle for Sale. $4000 OBO. Like New, runs great, title in hand & no issues, just don’t need it anymore! Make me an offer!", "json_obj": {"Melissa Kate Mason": {"text": "Jennifer Greer you know anyone looking for a bike?", "reply": {"Jennifer Greer": {"reply_text": "Melissa Kate Mason  I’ll ask the hubby!"}}}, "Vickie McQueen-Mason": {"text": "Great pics Melissa Kate Mason"}}}, {"Post": "Right on schedule. What do we win?", "json_obj": {"Arron Arce": {"text": "Let’s be honest here. Ray Charles could have seen that coming. And he’s dead."}, "Kimberly Geraci": {"text": "You don't win anything. None of us win anything. The best prize we might hope for is that the asteroid doesn't miss us after all.", "reply": {"Noah Patrick": {"reply_text": "Kimberly Geraci I mean... Yes."}}}, "Jonathan Beaulieu": {"text": "According to Biden, 250 million people have died in the US in the last 13 years due to the corona virus (Trumps fault) and gun violence (Bernie's) fault. Who the heck is left in this country to vote for this guy?", "reply": {"Adrian Apodaca": {"reply_text": "Jonathan Beaulieu did you forget about that already?"}, "Heather Brooks": {"reply_text": "Jonathan Beaulieu I will take Biden over Trump any day. Hell, I would take a literal piece of excrement over Trump."}, "Jonathan Beaulieu": {"reply_text": "Adrian Apodaca yes, please do. Biden has been in politics for what, 40 years? Let's compare the two, sure."}, "Carolyn Wagner": {"reply_text": "Jonathan Beaulieu you actually listen to and believe this shite?"}, "Lisa Núñez": {"reply_text": "Jonathan Beaulieu dude. Stop 🛑 drinking the kook-aid."}, "Stephen Haas": {"reply_text": "Jonathan Beaulieu have  you heard  Trump  give  a  speach,  or  talk  in  general?  Your  comment  about  Biden  is  just  so  fucking  stupid!"}, "Paul Seeley": {"reply_text": "I only need Trump's twitter to know he is evil."}, "Evan Crosby": {"reply_text": "Jonathan Beaulieu that's nowhere near the death toll from windmill cancer. Or how about Washington and the Continental Army defending the airports during the revolutionary war? Or Trump's gaffe during the 4th of July event in which he conflated Desert …See More"}, "Doug Nimmo": {"reply_text": "Jonathan Beaulieu yo semite"}, "Jackie de Souza": {"reply_text": "Jonathan Beaulieu  I wonder if Joe Biden had to go through that very difficult task of repeating these words....soooh difficult that only Trump could do it “ Person, Woman, Man, Camera, TV. 😮"}, "Ernesto Mancebo": {"reply_text": "Jonathan Beaulieu I'll take the occasional flub over a man who ignored the experts and got 175,000 Americans killed (and counting) that didn't need to die due to negligence."}}}, "Pat Ortiz": {"text": "Qanon needs to be taken more seriously as an emerging cult. It’s going to start breeding actual extremists.", "reply": {"Pamela Stuck": {"reply_text": "Pat Ortiz already has. One mass shooter so far. Hence why they shut it down on 3chan and it went then to 8chan. Then they shut diwn 8chan and it went to 8kun, which is a Russian server. Yes... you read it right... a RUSSIAN SERVER. Imagine that🤔"}, "Josie Hawks Mendonca": {"reply_text": "Pat Ortiz I'm Canadian and had to look up what Qanon was. Oh. Shit. Please. Vote."}, "Pat Ortiz": {"reply_text": "Ricky Harris inshallah soy boy 😘"}, "Atk Tennis": {"reply_text": "Pat Ortiz FBI already labeled them as potential threat"}, "Ricky Harris": {"reply_text": "Pat Ortiz ....the constitution breeds patriots, Nancy.  I need to drop your sloppy ass off in the Korengal Valley.  😂Extremists.......😂😂😂😂😂"}}}, "Joyal Völva Coub": {"text": "I want to watch more of Kimberly screaming into the void! 😅🤣🤣", "reply": {"Randi Blair-Nara": {"reply_text": "Joyal Völva Coub oh god no.  I just got rid of my headache from the last time I listened to that crazy ass."}}}, "Miishen Pitawanakwat": {"text": "If they really cared about the children why isn't a damn thing done for those kids in cages", "reply": {"Beth Landstrom": {"reply_text": "Don't forget, they only care about white, privileged children..."}, "Eric Mellmer": {"reply_text": "According to trump that was Obama who put the kids in cages 😂 Obama this, Obama that. In all seriousness, who gives a shit who did it? After four years in office, you're exactly right: nothing has been done..."}, "Heather Brooks": {"reply_text": "Andrew Burford the facility was built in 2014. And while Obama does need to answer for his horrendous immigration policies, at least they kept families together and didn't lose a bunch of kids. Trump himself has bragged how the family separation policy was all his doing. And ICE has lost thousands of children. Get the facts straight, buddy."}, "Kimberly Cravey": {"reply_text": "So I did research like many of you asked. Yes obama administration did build the cages and had immigrant children but it was under very limited circumstances involving the actual safety of the children. They separated parents who were either a direct threat to the child's …See More"}, "Sherri Isom": {"reply_text": "Aaaaaaand there it is, right on cue. Nailed it Eric Mellmer."}, "Andrew Burford": {"reply_text": "Miishen Pitawanakwat you can thank literally every single president (red or blue) for that. Trump inherited kids in cages. Obama put them in there. You just wont accept it."}, "Mikey Ellison": {"reply_text": "Didn’t I say I’m not disagreeing with anyone here lol some of y’all are triggered, because I not once said hooray for trump for filling the cages up 🙄"}, "Miishen Pitawanakwat": {"reply_text": "Ricky doing more for those kids then you are you fake patriot. Im not even from America and I'm doing my darn best."}, "Kevin Graves": {"reply_text": "Mikey Ellison yes it is"}, "Kathy Quasius": {"reply_text": "Miishen Pitawanakwat because it’s a big fat lie, they hate everyone, even each other"}, "Jennifer Carroll": {"reply_text": "Andrew Burford it doesnt matter who put them there. There should not be babies in cages. Wtf is wrong with you"}, "Jamie Arndt": {"reply_text": "Miishen Pitawanakwat #NotThoseChildren obviously 🤦‍♀️"}, "Lauren Marcum": {"reply_text": "Andrew Burford ACTUALLY, Obama only separated families in extreme circumstances (like abuse or criminal charges). Trump, on the other hand, had a zero tolerance policy and separated ALL families and had ZERO plans of reuniting them. Who doesn’t have their facts straight? 🙄"}, "Ricky Harris": {"reply_text": "Miishen Pitawanakwat you stuck on Obama’s cages, hero?  😂😂😂"}, "Liz Efting": {"reply_text": "Andrew Burford Did Obama mishandle the Covid crisis too?  IF (big IF) Obama started putting kids in cages, why hasn't Trump stopped it? He has bragged about how he instigated the family separation act. Is he lying?? Oh, right, he NEVER tells the truth."}, "Sharon Stavrou": {"reply_text": "Mikey Ellison    right so because  they were already.there means he had to fill them with children !!  Yep makes sense"}, "Robinson Harris": {"reply_text": "Jennifer Carroll well now you’re talking crazy!!!🙄🙄🙄"}, "Dhananjay Chhatre": {"reply_text": "Miishen Pitawanakwat “white children”"}, "Velasquez Mae Jo": {"reply_text": "Andrew Burford he didnt let them out though did he?"}, "Salazar Elaine": {"reply_text": "Mikey Ellison the economy was doing great before trump took office and he wants to take credit for that but the abuse of these children separated from family and held in cages."}}}, "Phillips Elizbeth Ayomiposi": {"text": "No one envies Americans RN cos y'alls president made the country into a shit show.Republicans are so stupid, it's hilarious 😂 🥴😂. Every one on Fox is out of their Goddamn minds 😂😂", "reply": {"Toni Borowsky": {"reply_text": "Phillips Elizbeth Ayomiposi agreed. Unbelievable🙄and they still think they’re the greatest"}, "Jerry Doll": {"reply_text": "Phillips Elizbeth Ayomiposi thank goodness you realize we’re not all the same. Thank you."}}}, "Beth Landstrom": {"text": "This convention is some scary shit", "reply": {"Michael J. Dillion": {"reply_text": "Beth Landstrom when is President Snow speaking to Dustrict 6?"}, "Richard Young": {"reply_text": "Beth Landstrom These bozos are all talk. Qanon can go fuck themselves."}}}, "Michelle Zentis": {"text": "You win sadness, Trevor.  We all win sadness.", "reply": {"Heather Brooks": {"reply_text": "Michelle Zentis I would like to pass on this showcase, Bob (or Drew, depending). Let me see the other showcase please. Doesn't it usually have a car in it?"}, "Joey Moore": {"reply_text": "Wyatt Neal remember staying home from school sick and watch the Price is Right and one showcase was like an all expenses paid trip Wisconsin, a hammock, a $50 backyard grill, and this lounge chair the model is sitting on, but the other one was a trip t…See More"}, "Wyatt Neal": {"reply_text": "Joey Moore are there any other show cases? This one seems a little ... \"Squeezy\""}}}, "Steve Benner": {"text": "I don't know about you, but I am SO STOKED for the toothpaste nanobots!!!"}, "Ana Iris Sanchez": {"text": "I was expecting Stormy Daniels as part of this convention. 🤣🤣🤣🤣🤣🤣", "reply": {"Ricky Harris": {"reply_text": "Ana Iris Sanchez she’s too busy sucking off Michael Avenatti to pay off her attorney fees 🤷🏼‍♂️😂"}, "Ana Iris Sanchez": {"reply_text": "Ricky Harris 🤣🤣🤣🤣🤣🤣"}, "Kevin Isleb": {"reply_text": "Ricky Harris She doesn’t need to do that anymore. trump’s gotta pay Daniels’ legal fees."}}}, "Debi C McKenzie": {"text": "A TRIP TO THE SWAMP WE SCOTS CALL #LOCHNESS", "reply": {"Debi C McKenzie": {"reply_text": "PS Nessie is not amused btw"}}}, "Cameron Scott Williams": {"text": "Clearly, the Nazi party is back and worse than ever...It’s like when Hydra came back", "reply": {"Robinson Harris": {"reply_text": "Cameron Scott Williams Bannon’s face is too saggy to be the Red Skull tho.👺"}}}, "Oscar M. Garibay-Contreras": {"text": "We got ourselves a speed reader (Jr) and a shouter. Looking forward to seeing a monster truck and a confederate flag deliver speeches to an empty chair."}, "Sira Prinyavivatkul": {"text": "Really wished the Democrats would just leave a picture of Hitler next to trump. They probably thought of it and decided against it since it would only help his cause.", "reply": {"Matt Blackburn": {"reply_text": "Sira Prinyavivatkul lay off the steroids dude. They are shrinking your brains and balls."}}}, "Juliette Beaupre Husson": {"text": "I still cannot get over the disaster of a show they put on last night!What a bunch of whackadoodles!", "reply": {"Kate Haberman": {"reply_text": "Juliette Beaupre Husson I’m so excited to find that I’m not the only person who uses the word “whackadoodle” 🤣🤣🤣"}, "Matt Haffner": {"reply_text": "Jennifer Carroll lmao. Yeah keep dreaming. I wonder how many hours your gonna cry when he’s re-elected"}, "Juliette Beaupre Husson": {"reply_text": "Matt Haffner Your society has crumbled in less than four years from pure hubris and your idiot leader is leaking secrets to your worst enemies in order to erase debt or raise money for himself.He has strengthened China, given back potential, future n…See More"}, "Jennifer Carroll": {"reply_text": "Matt Haffner oh there wont be crying. There will be other things"}, "Paul Seeley": {"reply_text": "Eric isn't a Trump troll trying to mess with you at all.  What a creeper.Ps. Trump is a traitor."}, "Aaron F Crouch": {"reply_text": "Juliette Beaupre Husson don't worry Matt Haffner gets upset after chugging trump cock. 🤷‍♂️"}, "Sharon Stavrou": {"reply_text": "Matt Haffner   not one cause he doesnt have a chance in hell .. not even in the hell.he has created"}}}, "Toni Borowsky": {"text": "And they equate NAZI with socialist. But guess who the Nazis really are!", "reply": {"Toni Borowsky": {"reply_text": "Smosh Smaxline is that supposed to be clever?  Bc it’s just too clever for me to understand. Sorry"}}}, "Stephen Haas": {"text": "So  proud  to  be  Canadian,  I  feel for ya  America", "reply": {"Paul Seeley": {"reply_text": "We have to help the Democrats so this crap doesn't spread to us more than it already has.  But help in a way that makes it look like they didn't get any help from other countries, lol."}, "Nancy Slack": {"reply_text": "Stephen Haas have room for 2 more?"}}}, "Andrew Burford": {"text": "You don't win any kids, Trevor. You have to keep them in that wardrobe from wayfair."}, "Maximíno Reyes-Chavez": {"text": "I can already hear Hitler yelling \"Oooh shit, better light the furnaces...\""}, "Fernando PV": {"text": "Believe the Daily Beast / Condemn conspiracy theoriesPick one"}, "Nicolas Mrozowski": {"text": "Literally every Daily Show post I've seen this week, has been about Qanon. Interesting.", "reply": {"Juliette Beaupre Husson": {"reply_text": "Nicolas Mrozowski Why not? How many times in history have we seen anything so pathetic? Never."}, "Victor Wilburn": {"reply_text": "The real question here, Nicolas, is why is it only the QAnon posts showing up on your newsfeed?  I mean, facebook shows you stuff similar or related to stuff you already interacted with."}, "Nicolas Mrozowski": {"reply_text": "James Nelson but none of the things you mention are ever posted by Q in any way, so why are they trying to spin this so hard? Kinda makes you wonder why they would waste so much time and money for a \"bs conspiracy\""}, "James Nelson": {"reply_text": "How could a comedy show resist?  Trump heroically fighting satanic cannibal pedophiles?  It doesn't have the elegant perfection of Anthony Weiner's weiner, but that's some good shit."}}}, "Gary McGonigle": {"text": "Who believes the crap they are trying to sell?", "reply": {"Victoria Amy": {"reply_text": "Gary McGonigle so your a Trump supporter welp...you actually believe in that Qanon stuff yikes.....or have you confused me for one 🤔🤔🤔"}, "Gary McGonigle": {"reply_text": "Victoria Amy go back to the funny papers."}}}, "Shelley Ruth Michelle Burden": {"text": "Listening to Tiffany?? the one he wanted to have big boobs like her mum!!!  she hasn't spent much time with dad...she can speak well & sounds like she should be on the other side!!"}, "Suraya Jada": {"text": "I want to know Jr's drug dealer. Damn cocaine is a powerful drug!"}, "David Hallyburton": {"text": "Any surprise it’s rooted in ignorance and racism?"}, "Lisa Marie Garnet": {"text": "Me seeing QAnon infiltrate Anonymous..."}, "Tyler Cancro": {"text": "It’s like watching yourself punch yourself in the mirror."}, "Hunter Miche": {"text": "I'd say we've jumped right to Thursday though"}, "Shantel Boucher": {"text": "“Give Trump credit,” he continues. “He did his homework well and became the twenty-first-century master of divisive rhetoric. We’re used to thinking of Hitler’s Third Reich as the incomparably evil tyranny that it undoubtedly was. But Hitler didn’t tak…See More", "reply": {"Precious Goggins": {"reply_text": "Could? It is happening."}, "Natz Fabiaña": {"reply_text": "Shantel Boucher So very well said, such deep insight and learned discourse!"}}}, "Pamela Stuck": {"text": "https://medium.com/.../qanon-the-trumpist-cult-of-the..."}, "Jonathan Parella": {"text": "😂"}, "Jesus Timaure": {"text": "https://youtu.be/dBj9ZDC_Ad8"}, "Kevin Graves": {"text": "So the QAnon speaker was canceled for tweeting a long winded rant about Jews and she was scheduled right before Pompeo who's giving his speech....in Jerusalem!!!😂😂😂. F*cking Republicans are hilarious. Sheldon Adelson wouldn't like😂", "reply": {"Paul Seeley": {"reply_text": "Too perfect.  I wonder which Republican who still has his head screwed on tight enough and a voice at that convention caught this in time."}, "Velasquez Mae Jo": {"reply_text": "Paul Seeley none of  them"}, "Kevin Graves": {"reply_text": "Pamela Stuck https://www.thedailybeast.com/rnc-speaker-boosts-qanon..."}}}, "Nick Jour": {"text": "DEMOCRATS: We want to spike your taxes, take away the second amendment rights, give reparations paid by all tax payers even though none of the were slave owners. DNC NIGHT 2: If you don’t Vote for then you ain’t black.", "reply": {"Don Halliburton": {"reply_text": "Nick Jour Your stupidity is astounding."}, "Matthew Morelli": {}, "Jade Rodriguez": {"reply_text": "Nick Jour the burden of proof is on the accuser. If you were legitimately having a serious discussion in good faith then its up to you to prove your claim. If you can't then your claim is void. You can't just make wild claims then demand others prove you wrong doing that shows your purpose is only to create conflict not have a genuine conversation"}, "Toni Borowsky": {"reply_text": "Nick Jour oh for fucks’ sake go get yourself an education."}, "Milton Deer": {"reply_text": "just a trolling trumpet"}, "Matt Stoddard": {"reply_text": "Probably be funnier if you checked your sentences for missing or wrong words first. Probably, but not guaranteed."}, "Richard Young": {"reply_text": "Nick Jour Must be bored."}, "Adrian Apodaca": {"reply_text": "Richard Young dinner isn't ready yet for him. Mom will call him from the basement soon enough. 🤣"}, "Timothy Donahue": {"reply_text": "Nick Jour ok, let's talk about your claim he wants to spike our taxes.  Sorry, you don't strike me as the type making over $400,000 a year. Your first claim has been debunked. Go back to the kiddie table, you're not ready to talk politics with the adults.https://www.reuters.com/.../fact-check-joe-biden-has-not..."}, "Josh Hunter": {"reply_text": "Nick Jour they don’t preach, we’re obviously all godless socialists and don’t go in for that nonsense"}, "Nick Jour": {"reply_text": "Josh Hunter prove me wrong"}}}, "Mark Rowe": {"text": "Trevor is a looser.Na Na Na Na Na Na Whats your show gonna be like next year.…See More", "reply": {"Jennifer Carroll": {"reply_text": "Mark Rowe Joe Biden is not my pick. But I will vote for him because the fucking pig in the white house is done. I dont care who the democratic nominee is."}, "Pamela Stuck": {"reply_text": "Mark Rowe wow... they actually pay you for trolling? How old are you? 12?"}, "Aaron F Crouch": {}, "Mark Rowe": {"reply_text": "Jennifer Carroll So you are stupid lolYou just said it.…See More"}}}, "Daniel J. Febo": {"text": "TRUMP 2020", "reply": {"Aaron F Crouch": {"reply_text": "Daniel J. Febo pathetic. 😂"}}}, "Cristopher Suarez": {"text": "Pier Bianchi Jose Suarez Maryluz Suarez Amelia Suarez Victor Hodgins"}, "Atk Tennis": {"text": "Aliens?"}, "Richard Young": {"text": "Wow!"}}}, {"Post": "Crowds have been gathering in Kenosha, Wisconsin to protest the shooting of Jacob Blake, the victim of yet another act of senseless police brutality. Blake was shot seven times in the back, in front of his children. We won't stop until we end the epidemic of police violence against Black and Brown people in this country.  Photo Credit: Justin Barbin", "json_obj": {"Marianne Folino Mogavero": {"text": "Don't get me wrong, there should be justice for Jacob, and policing reforms have to be made. With that said, I just pray, there is no violence, and that any agitators are dealt with swiftly. I say this because if this situatiion gets out of control, it falls right into #45's lap. And WI could very well will hand him a victory. Nothwithstanding, fires up his base even more so, and could drive numbers in his direction."}, "Angel Almanza": {"text": "Much love and support from Portland!!! No justice - No Peace!!!", "reply": {"Marianne Folino Mogavero": {"reply_text": "The No Peace part, will hand the biggest Racist in this country a re-election victory."}, "Angel Almanza": {"reply_text": "Marianne Folino Mogavero based on what Karen?  Your intuition? 😆"}}}, "Linda Lutzke": {"text": "The cops that are doing this are reacting with anger . The children in the car have now been conditioned to hate the police,  So very sad."}, "Willem Ellis": {"text": "The police can stop what is happening on our streets by simply stopping the needless police killing. There is no excuse for shooting anyone in the back in short distance for ‘not complying’ in spite of what right wingers want us to believe. The police have ultimate control of the path forward given to them by our adoration for law and order.It seems they are choosing violence."}, "Jessica Tholstrup": {"text": "This is a horrific tragedy. I hope the officers involved have to answer for what they have done. There is no excuse for how this was handled. And his poor babies who watched it. Just awful.", "reply": {"Dan Johnson": {"reply_text": "Jody Newhouse you are intentionally not looking at the big picture.   They tried to prevent him from creating a deadly situation,  by tasing him.  As you can see,  tasers don't always work.   They even gave him several commands to prevent his death.  T…See More"}, "Sharon Smith": {"reply_text": "Dan Johnson What a bunch of BS you just spewed!!! What kind of cowardly asshole shoots a man in the back 7 times???"}, "Jody Newhouse": {"reply_text": "Dan Johnson If the only way all of those officers could think of to stop one unarmed man was to shoot him in the back, they have no business being on any police force."}, "Christina Hartley-Conroy": {"reply_text": "Jessica Tholstrup this was murder."}, "Kalee Mack Brenner": {"reply_text": "Christina Hartley-Conroy It was horrific, but he is thankfully alive."}, "Jessica Tholstrup": {"reply_text": "Im with Of course your name is “Im with him”why doesn’t that surprise me? Violence doesn’t fix the problem. Neither does hate.  It only fuels the fire but that’s what you Drump followers like. He has made it way to comfortable and easy for his follower…See More"}, "Im with Him": {"reply_text": "Dawn Castro he asked for it; https://m.youtube.com/watch?v=l1uv7DU8Q2Y"}, "Dawn Castro": {"reply_text": "Im with Him says who? Andy Ngo? You might want to look into your “news source”...otherwise known as a “fine person” by Trump, but the real name of the group is the “Proud Boys”. Don Jr. likes to retweet his bullshit too, and deletes it when it’s proven to be bull-shit 💩"}, "Merritt Olsen": {"reply_text": "Jessica Tholstrup https://www.statista.com/.../people-shot-to-death-by-us.../"}, "Jordan Krason": {"reply_text": "Jessica Tholstrup the police did nothing wrong."}, "Laura Holden": {"reply_text": "Jessica Tholstrup Are those conflicting statements?"}, "Vaughn Heifner": {"reply_text": "What kind of a father leads the danger to his children? A real father sacrifices himself to save his children."}, "Chris King": {"reply_text": "Christina Hartley-Conroy Murder implies someone died. Jacob Blake is alive. If you're going to advocate for something you believe in, at least know the facts before hand."}, "Sherry Ketterling": {"reply_text": "This pos raped a minor child!‼🤬 What happened to SAVE OUR CHILDREN ???https://us24news.com/.../breaking-jacob-blakes-criminal.../"}, "Susan Galante": {"reply_text": "Sherry Ketterling where is the rape stuff?"}, "Pam Fee": {"reply_text": "Kim Wilson    I’ve seen those with the scam money makers that show up in other groups.  Guess we just ignore his but."}, "Kim Wilson": {"reply_text": "Pam Fee It appears to be a page, as opposed to a personal account. What I hate about those is that I can't block them."}, "Freddy Trevino": {"reply_text": "Im with Him you're asking for it"}, "Gloria Abad Suan": {"reply_text": "Dan Johnson bulldshit."}, "Reyes L Martinez": {"reply_text": "Jessica Tholstrup the cops would have taken him and his family to lunch"}}}, "Sandi Beck": {"text": "No justification. Cop was right behind Blake, shot him 7 times. Even IF Blake had been \"going for a gun\" he was hemmed in by the car door and the cop close behind him. He would have to turn around and raise his arm to get a shot, in a tight space. But guess what, no gun! THIS IS BS, ENOUGH!"}, "Gail Rice": {"text": "There is no justification for such brutality. None whatsoever. Enough!", "reply": {"Greg Steenken": {"reply_text": "Robin Day I’m only defending the police from unfounded accusations"}, "Justin Bates-Riordan": {"reply_text": "Greg Steenken he wasn’t under arrest, hence he wasn’t resisting."}, "Suzanne M. Lambert": {"reply_text": "Greg Steenken Oh, and what utter nonsense."}, "Robin Day": {"reply_text": "Greg Steenken Maybe you should follow your own advice."}, "Derrick Ryan": {"reply_text": "Sherry Ketterling The Save Our Children hashtag is a QAnon shit page.  Also, you’re probably a Russian Troll"}, "Jon DeLess": {"reply_text": "Gail Rice absolutely true without a doubt Gail"}, "Jessica Hollis": {"reply_text": "Greg Steenken police don’t get to murder people just because people don’t listen to them, just FYI"}, "Laura Holden": {"reply_text": "Greg Steenken Calling people names does not support your important observation."}, "Sherry Ketterling": {"reply_text": "This trash raped a minor child!‼🤬What happened to SAVE OUR CHILDREN ???https://us24news.com/.../breaking-jacob-blakes-criminal.../"}, "Jesse Stevens": {"reply_text": "Sherry Ketterling he had not been convicted of any such thing."}, "Christine Brannon-Miles": {"reply_text": "Sherry Ketterling here’s your “news” outlet 🤣“In review, 24 News takes a current right biased news story and interjects opinion around the content. Article headlines contain loaded emotional language such as this: Ocasio-Cortez Attacks PRAYER After New Zealand Mosque Attack, Twitter Explodes from All Sides. News stories are generally sou…See More"}, "Frank Magyar": {"reply_text": "Greg Steenken seven shots point blank range to the back. Calling the cop a POS attempted isn’t an unfounded accusation. There are thousands upon thousands of good cops. This guy wasn’t one of them."}}}, "Jay Erickson": {"text": "Cop saying stop doesn't give the cop a right to shoot someone.", "reply": {"Renee Dalglish Tomporowski": {"reply_text": "Siera Griffin he clealy was resisting arrest. Police had him down on the ground.  He kept resisting!!!"}, "Jordan Ommanney": {"reply_text": "Renee Dalglish Tomporowski he was resisting arrest because the cops showed up to intervene in a fight between 2 women and immediately became hostile with him for being there, He was running to his car because a cop just tazed him and drew a gun on him, and he wasnt reaching under his seat he was getting into the car."}, "Dannielle Marie": {"reply_text": "Renee Dalglish Tomporowski even if!! It wasn't on his person. He wasnt brandishing it anyone, none the less pointing it at a cop or threatening anyone. How many white people pack under their front seat? I know a few. Does that justify him being shot? No! Renee, your argument is stupid."}, "Siera Griffin": {"reply_text": "Renee Dalglish Tomporowski Clearly you're evading. Classic tactic when you have no actual argument troll."}, "Diedre Brunk": {"reply_text": "Renee Dalglish Tomporowski Oh look, a racist trying to justify a cop trying to publicly execute a citizen who committed no crime"}, "David Myers": {"reply_text": "Renee Dalglish Tomporowski, why were the police so fucking incompetent that they couldn't restrain him some other way?  Why is it okay that they just murder anyone they want to?"}, "Dana Dblock Schnedeker": {"reply_text": "Renee Dalglish Tomporowski racist troll gtfo"}, "Tiffannie Marie": {"reply_text": "Jay Erickson its crazy how many people don't realize that non compliance and resisting arrest are not lawful reasons for deadly use of force."}, "Wilfredo Manzo": {"reply_text": "Renee Dalglish Tomporowski Oh you mean the “investigation” by the same department? That’s what’s causing people to revolt."}, "Craig Altmire": {"reply_text": "Renee Dalglish Tomporowski ok, freak!"}, "Karen Eshleman": {"reply_text": "Renee Dalglish Tomporowski he  was  SHOT  IN  THE  BACK!  Where’s  ANY  justification  for  that?    SEVEN  times. You  are  obviously racist to  the  core"}, "Mike Watt": {"reply_text": "Renee Dalglish Tomporowski wow."}, "Myra Warburton Parkhurst": {"reply_text": "Craig Altmire I think the biggest problem is good cops who are afraid of retaliation if they turn in bad cops"}, "Cristian Restrepo Lopez": {"reply_text": "Was he supposed to let him drive away?"}, "Mike Leaver": {"reply_text": "Jay Erickson 7 times....😢"}, "Kathleen Cashton": {"reply_text": "Renee Dalglish Tomporowski Maybe he was afraid of the police and obviously with good cause."}, "Stefan Kindub": {"reply_text": "Jay Erickson but it does when suspect ignores cop’s numerous commands to stop while reaching in car for a gun . Even if there was no gun , reaching into the car cops simply do what they were trained to do and that is to eliminate a threat to be able to go home"}, "Jay Erickson": {"reply_text": "Stefan Kindub they'll have to change or the cops will be defunded. That doesn't mean no more keeping citizens safe just the approach will be different."}, "Dennie Sueirro": {"reply_text": "Jay Erickson absolutely. Why do we have to do what police say????? Is it written that I have to obey them? Seriously, is there an actual law?"}, "Lindsay Kate Pritchard": {"reply_text": "Cristian Restrepo Lopez  ok. By your logic... could they have stopped him or the vehicle in some other way? Could they have apprehended him (for questionable reasons) by other means? The answer to both is yes btw."}, "Luke Petersen": {"reply_text": "Craig Altmire he was tased with a stun gun right before walking to his car."}}}, "Ayana Dixon": {"text": "If failure to comply warrants a death sentence, then not a single human would live past puberty.", "reply": {"Suzie Bowns": {"reply_text": "Ayana Dixon sorry but we are talking about complying with police!😂😂😂😂"}, "Ayana Dixon": {"reply_text": "Suzie Bowns sorry. Unless you are Jesus Christ himself you have not been a perfect saint. All children misbehave, including you, and we don't kill them for doing so. Great job for missing the point.🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️"}, "Trish Abramo": {"reply_text": "Suzie Bowns neither did he"}, "John Nemetsky": {"reply_text": "Make all the arguments you want, but this never would have happened to a white man.."}, "Marian Dobles-Millares": {"reply_text": "Suzie Bowns Protect and serve. Not comply or die."}, "Mercy Weber": {"reply_text": "Adam Kneram https://www.facebook.com/1523615217860667/posts/2688292168059627/"}, "Adam Kneram": {"reply_text": "Mercy Weber so is driving 26 mph in a 25 mph speed limit zone. So you'd be cool with it if one of your family members was shot 7 times for doing that?"}, "Frank Magyar": {"reply_text": "Suzie Bowns so failure to comply gets seven shots to the back? Sad that there’s any part of you that thinks that is okay."}}}, "Candace Renee": {"text": "Humanity is absent here... to the people justifying this, see you on November 2nd", "reply": {"Rita Parker": {"reply_text": "Joe Kanzleiter have had to delete some of mine after reading some posts over again. Its hard!"}, "Joe Kanzleiter": {"reply_text": "Rita Parker lol that definitely makes sense and comment deleted"}, "Stefan Kindub": {"reply_text": "Ken Croatman is that before or after you pull a knife or gun on them? 🤨Asking for a friend"}, "Jessica Tholstrup": {"reply_text": "Candace Renee  blue wave is a coming!!"}, "Ken Croatman": {"reply_text": "Stefan Kindub Question authority first."}}}, "Laure Olson": {"text": "Only one thing to do. Fire the entire force and start over with stringent testing approved by at least 3 pyschologists,  3 psychiatrists, a board of citizens including black, brown, asian, native American and all women, one man."}, "Janet Mills": {"text": "Doesn't the fact that three young children were in the car say enough about what kind of a cop that was?", "reply": {"Mercy Weber": {"reply_text": "Janet Mills then why did the dad go back to the vehicle when cops with guns drawn were talking him to stop? What kind of dad is that?"}}}, "Terry Morehouse": {"text": "With SEVEN BULLETS in his back? I'm sure a taser would have effectively stopped him. Was that not something in the police officers arsenal?"}, "Virginia Ford": {"text": "There should only be peaceful demonstrations with Masks. I get there frustration and I'm white..", "reply": {"Courtney Evans": {"reply_text": "Virginia Ford No you don't ."}, "Suzanne Thangaratnam": {"reply_text": "Virginia Ford you definitely don't 'get their frustration' BECAUSE you're white."}, "Benjamin Brooks": {"reply_text": "Virginia Ford I get their frustration and I am also white. To the rest: last I checked, white people are killed by police at a higher rate in the majority of the country. Don't need to be racist against white folk who are on your side, you dimwitts..."}, "Anthony Denning": {"reply_text": "Virginia Ford I'm white too. We don't get it. We can't. That's not an insult to you, me, or anyone. It's just fact. It is literally something we cannot experience and that will always limit our understanding. We can imagine, but even then we need their experiences as reference."}}}, "Albert Milo": {"text": "So glad to see ACLU Legal Observers present...and so easily identifiable."}, "Cyndi Loveland": {"text": "He was so close to him to shoot at point blank range! Awful. I think the guy had tried to break up a fight, the cops arrived and he decided to leave and let the cops handle it. Hus kids were in the car!!!"}, "Lisa McMurphy": {"text": "Its time we hold all  Racists policeman responsible  and give  them life sentences  i can bet in time the killings  will stop"}, "Jennifer Stage Christenson": {"text": "Why are some of you on this page? This page clearly is not for you.  Making excuses for the police that shot him in the back.  🙄", "reply": {"Jessica Tholstrup": {"reply_text": "Jennifer Stage Christenson  yes it is. Seems like they have been showing themselves more and more since 2016. Hopefully in November it’ll start to change."}, "Jennifer Stage Christenson": {"reply_text": "Brian McBride - do you know what the ACLU stands for?"}, "Brian Keller": {"reply_text": "Jennifer Stage Christenson thank you !!"}, "Rachel Lundgren": {"reply_text": "Jennifer Stage Christenson they like to talk but don't necessarily feel the need to know what they're talking about. But the have to talk or they cease to exist."}, "Brian McBride": {"reply_text": "Jennifer Stage Christenson  oh dang. Is this page only for virtue signaling?! Oops."}, "Kris Webb": {"reply_text": "Jennifer Stage Christenson, They are trolls."}, "Brittany Dickinson": {"reply_text": "Brian McBride why, are you lacking good virtues and a moral compass there?  Would you shoot an unarmed man in the back?"}}}, "Linda Thick": {"text": "Can’t believe this just keeps happening,where is the president,oh I forgot he’s campaigning"}, "Cecilia Sanchez": {"text": "Peaceful demonstrations, not burning or tearing down the city, just as his mom asked!"}, "Robyn Soden": {"text": "They escalated this situation; they are expected to handle it appropriately."}, "Greg Heim": {"text": "This is what the outside of NYC PBA’s Patrick Lynch’s house should’ve looked like for months every day.Protest the heads of the police unions like this. They’re the heads of the snake with the power to thwart reform."}, "Mark O'Connell": {"text": "Our law enforcement model is past due for an overhaul."}, "Mike Outten": {"text": "No, you don't get shot , worst case scenario is he drives away and picked up later for disorderly conduct"}, "Susan Wheadon": {"text": "7 shots in front of his children Terry", "reply": {"Stefan Kindub": {"reply_text": "Susan Wheadon while holding a knife and reaching in a car for a gun 🤨"}, "Susan Wheadon": {"reply_text": "Stefan Kindub 7 wasn’t enough for you Sfefan"}, "Charmaine Ortega Getz": {"reply_text": "Stefan Kindub No verifiable evidence from credible sources. You got it, post it."}}}, "Terence David": {"text": "But the cop was frightened! He thought his life was in danger! He reached for his non existent waistband. You can see how this goes can’t you?"}, "Betty Ann Vaughan": {"text": "They could have followed him home. They could have tapered him. He posed no physical threat."}, "Cheryl Wisniewski": {"text": "I could not believe the video. Policeman had him by the back of the shirt & just shot him 8 times in the back for no reason", "reply": {"A Christian Resistance": {"reply_text": "They had a reason: White Male Rage."}}}, "Denise Cook": {"text": "How about non-lethal measures? Seven shots???!!!", "reply": {"Kelly Moran Barrett": {"reply_text": "Denise Cook IN THE BACK !"}}}, "Christopher Dragunfire Norbert": {"text": "Not the entire story", "reply": {"Geoffrey Barnett": {"reply_text": "There is no part of any story anywhere that will ever justify shooting someone in the back seven times.  It is absolutely never justified in any circumstance."}, "Bri Vas": {"reply_text": "Christopher Dragunfire Norbert so whats the actual story since it seems like you were there at the scene watching everything unfold."}, "Christopher Dragunfire Norbert": {"reply_text": "Bri Vas no the actual story, that's just  after the fact."}}}, "Katy Mullen": {"text": "If your response to an unarmed black man getting shot by the cops 7 times in the back in front of his children is to ask what he did to deserve that, you really need to stop insisting that all lives matter to you!", "reply": {"David Lincoln": {"reply_text": "Katy Mullen i ask that question regardless of the victim's race"}, "Julia O'Brien": {"reply_text": "David Lincoln Sure you do🙄"}, "Marcia Switzer": {"reply_text": "Katy Mullen well said."}}}, "Brian McBride": {"text": "Tragic, but not “senseless”. He refused orders and went to his car. It’s bad enough without exaggeration.", "reply": {"Jeffory Shelton": {"reply_text": "Brian McBride the three should have tackled him long before he got to the door of his car but they couldn't tackle him because they were too busy pointing their guns at him already.😐"}, "Eve Johnson Wilson": {"reply_text": "Brian McBride are you saying he deserved those 7 shots in the back? How can you not see how senseless it is that his children had to witness it??"}, "Brian McBride": {"reply_text": "Jonathan Haruni Bravo! Pure evil..off to the Gulag!"}, "Trish Abramo": {"reply_text": "Brian McBride no reason to shoot him in the back"}, "Trevor Terry": {"reply_text": "If they can't be SURE what the guy has in his hands BEFORE shooting he doesn't deserve the badge..."}, "Dawn Franklin": {"reply_text": "\"Refusing orders\". And exactly what makes walking away an offense worthy of 7 bullets in the back?"}, "Jonathan Haruni": {"reply_text": "Brian McBride In \"my country\" which happens to be the actual one we live in, police who are trained and professional should be able to handle situations far, far more difficult than this one without shooting anyone, even if they are actually armed and …See More"}, "Anna Mcallister": {"reply_text": "you're making things up to fit your bias. the police weren't even there for him, they were there because of some women fighting. instead they decide to shoot the black guy around 7 times. the video doesn't show him reaching under his seat and i can't f…See More"}, "Mélanie Celeste Casau": {"reply_text": "Brian, absolutely senseless. Regardless that he should have complied, the answer was not to shoot him in the back. And 7 times!"}, "Katie Moore": {"reply_text": "So? Not listening to the cops isn't a death penalty offense."}, "David Foster": {"reply_text": "i would like more details on what transpired, but I have to imagine this didn’t have to end with this young man being shot at point blank range. Seven times. In the back."}}}, "Laura Szelagiewicz": {"text": "This world has gotten so dark..people need to think if this was someone I know and love would they deserve this? Would their thought process change?  Literally  picture it do you see a possibility he was going to kill a officer at that moment? Could th…See More"}, "Rick Turner": {"text": "When we need you most you've risen to the challenge. Thanks ACLU!!"}, "Nancy Grasso": {"text": "I’ll say this again and every time this happens the police are not judge, jury and executioner there was another way without this man being paralyzed for life", "reply": {"Jillian Sarkady": {"reply_text": "Nancy Grasso you are damn right about that."}}}, "Luis H. Lopez": {"text": "Police are not going to stop killing us anytime soon , we must keep protest around the country and world going no matter who is in the White House.", "reply": {"Trevor Terry": {"reply_text": "Why not mandate police body cams and liability insurance like doctors have for malpractice?"}}}, "Bud Harris": {"text": "Senseless?  Do you have full knowledge of what transpired prior to the shooting?  Do you know what he was reaching for in his vehicle?  YOU are fanning the flames.", "reply": {"John Vallow": {"reply_text": "The governor has stated that there were NO weapons found. How's that?"}, "Kris Webb": {"reply_text": "John Vallow, Thank you."}, "Brittany Dickinson": {"reply_text": "Bud Harris apparently YOU think you know what they saw (which they didn't)Quite excusing 7 bullets in the back for non-compliance. …See More"}, "Bud Harris": {"reply_text": "Jerry Amundson REACHING FOR A GUN WHEN THREE COPS ARE ALREADY DRAWN ON YOU MAKES YOUR ASS GET SHOT."}, "Jerry Amundson": {"reply_text": "Oh heck, you knew he was reaching for a gun! You should've said so right away!"}, "Meira Perelstein": {"reply_text": "Bud Harris “Awwww.  Blocked by the snowflakes.”Tell the truth, isn’t this the heart of the Republican platform? Just hatred of liberals?"}}}, "Craig Hames": {"text": "walking away from a cop unarmed is no reason to be shot in the back. police are not the judge or jury and it is high time that they stop acting as though they are. Defund the police and shame on you for suggesting anyone be shot for what would be a misdemeanor crime.", "reply": {"Stefan Kindub": {"reply_text": "Craig Hames here , watch this video and see how well police tasers work . https://youtu.be/eXhwZk6_cHU"}, "Craig Hames": {"reply_text": "are we really. it seems like we are forgetting that more and more all the time. now days you are convicted by police and the media and due process is but and after thought."}, "Jordan Ommanney": {"reply_text": "Stefan Kindub the video doesn't show him having a knife. The video doesn't show him saying he has a gun. The video doesn't him reaching for something in the car. He literally went to get into his car, thats it."}, "Aliceson Tigrett-Smith": {"reply_text": "Stefan Kindub OR how about tase him instead of shooting him in the back 7 damn times like a coward. What happened to trying to detain without killing?! They had plenty of time to get him down to the ground."}, "Luke Petersen": {"reply_text": "Craig Hames the taser didn’t work. If you watch the video he walked away from the cops whilst being tased. You can hear the taser go off. So he went into his car for something with a taser wire hanging off him."}, "Rachel Hager": {"reply_text": "Craig Hames yes. In America we are innocent until proven guilty in a court of law."}, "Robyn Soden": {"reply_text": "Stefan Kindub protocol has got to changed."}}}, "Deniece Dover": {"text": "It appears he did not comply but my eyes...heart and mind cannot grasp how 7 shots in the back was deemed necessary and justifiable. I just cannot get myself to see it. 7 shots in the back and I have yet to see a weapon drawn on any officer. Where was …See More", "reply": {"Ben Boorman": {"reply_text": "Deniece Dover witnesses need not comply!"}}}, "Grace McLeod Bohan": {"text": "Were you there to actually witness what you are posting??"}, "Melida Hansen": {"text": "Can’t take credit for this...If they are asking that we protest without violence -then police should arrest without shooting and killing someone.", "reply": {"Kris Webb": {"reply_text": "Melida Hansen, Sounds fair to me."}}}, "Terry Ray Gist": {"text": "Maybe if the cops were not so worried about the public scrutiny they would have immediately taken this person down and controlled the situation. But instead they handled him with kid gloves untill it got out of control.", "reply": {"George Spies": {"reply_text": "What planet are you from?"}, "Ariel Rudy": {"reply_text": "Terry Ray Gist I know that I often get so worried about how people perceive me that I have to (checks notes) shoot people at point blank range in front of their kids"}, "Mercy Weber": {"reply_text": "Ariel Rudy they tazed the guy he got away from the officers. They waited til he was going into the vehicle to retrieve a weapon or possibly use the vehicle as a weapon. Come on."}, "Joseph Larson": {"reply_text": "You mean when the cops got out of control and shot him 7 times? Because THAT was necessary."}}}, "Scott Lucier": {"text": "We need to disarm the f****** police like now give him nightsticks like the old days take away the rubber bullets and all the rest of that crap let's make it mono y mono", "reply": {"Jevin Gentry": {"reply_text": "Scott Lucier This is possibly the most ignorant comment ever posted on FB. Congrats"}, "Scott Lucier": {"reply_text": "Yes ma'am I agree with you it's a shame that young man got killed for nothing and it's kids watched you're not going to tell me those policemen couldn't make a rational decision at that second all jump on him or tase him or something no they decide to put the kids lives in danger big mistake kenosha's going to get sued to the living hell"}}}, "Terry Moore-Smith": {"text": "That man was told to stop! He was already being threatened of being shot. When this is the situation, you don’t ignore what they say and go to retrieve a weapon from your car! He chose the behavior & here is the consequence. This is not the same as the George Floyd situation", "reply": {"Terry Koenig": {"reply_text": "Terry Moore-Smith I will type slowly so you understand:  police do not have the authority to use deadly force absent immediate jeopardy to life,   period.  They could have taken him down if they had issues , unless they are too fat to catch him walking. Pumping 7 or 8 shots into his back was not justified."}, "Catlin Marchand": {"reply_text": "Terry Moore-Smith wait so failure to comply is justification for extra judicial killings?I keep seeing more and more people saying he was going for a weapon, care to prove it?…See More"}, "Annie Thornton": {"reply_text": "Believe it or not, not listening to a cop doesn't mean you deserve to be shot 7-8 times in front of your children. Wild I know"}, "Richard English": {"reply_text": "Terry Moore-Smith this isn,t about the man's behavior, it is about the police reaction"}, "Tina Howard": {"reply_text": "Terry Moore-Smith why don't you Bootlickers ever care about the truth? No weapon retrieved at the scene. Try harder."}, "David Lindenmuth": {"reply_text": "There were no weapons found on his person or in his vehicle.  Stop spreading lies."}, "Kate Lynn": {"reply_text": "Ok so i tell you to stop. You don't listen. I shoot you. Pretty simple logic. Im sure your grandkids listen 100% of the time.…See More"}, "James Roberts": {"reply_text": "Terry Moore-Smith Disobeying a police officer is not punishable by death."}, "Margo Stewart": {"reply_text": "Terry Moore-Smith it's not the police officers job to be judge jury and executioner. You don't get to shoot a man in the back for non compliance. It is absurd to believe that is ok."}, "John Hightower": {"reply_text": "Terry Moore-Smith there's combat zones that are more chaotic than that side walk. And 99.9% of the time when a detainment of persons have to happen, they're not dead or shot, they're put into proper custody. Unfortunately these cops probably had only three months of training, and didn't have much training on how to de-escalate a situation before it ever came to drawing their weapons."}}}, "Marky Moore": {"text": "The thing about defunding police is to redirect funds into training and obviously selection of those who are hired to preserve and protect.  Seems that all too often property is valued greater than human lives...especially when it comes to black men.  There is no justification possible for the disparity in treatment of Black Lives - which do - matter!!"}, "Kathy Richkind": {"text": "Arm cops with rubber bullets.  Then they could only blind and maim."}, "Len Marturano": {"text": "Assuming facts not in evidence. You are showing your trueColors."}, "Ed Bacon": {"text": "Pierced my core to see such brutality perpetrated by one human on another. Arrest and charge the officer."}, "Christine Tharp": {"text": "Where’s the pictures of the fires?", "reply": {"Justin Bates-Riordan": {"reply_text": "Christine Tharp who cares about fires. If cops stopped killing unarmed people, they’re wouldn’t be protests or riots."}, "David Lindenmuth": {"reply_text": "Christine Tharp, then maybe the property owners should demand more accountability from the police.  Problem solved."}, "Tiffannie Marie": {"reply_text": "Christine Tharp seems like the citizens are protesting for their livelihood."}, "Christine Tharp": {"reply_text": "Tiffannie Marie by attacking other citizens?"}}}, "Mike Ziccardi": {"text": "Let's remember ..trump told the police ..3 years ago to \" not be so nice\".....and they listened."}, "Meechelle Tomas": {"text": "Beyond peed off this has to stop now!!!"}, "Tyler Krpata": {"text": "“He might have been going for a gun” said all the mask-averse patriots who would obviously have applied the same logic to the Minneapolis protestors who absolutely were open carrying guns. Right?"}, "Chris Livengood": {"text": "Local case of a woman actually shooting at police.  She wasn’t shot.  …See More"}, "Kevin Green": {"text": "A cop yelling stop after being physically assaulted then threatened with a knife and then yelling he getting a his gun has the right to be shot. Fact"}, "Lisa Murad": {"text": "It’s not that it’s suddenly “trendy” to call out racism where it exists here in America; what is happening is that the country is finally articulating the crime of systemic institutionalized racism imbedded in our culture. The public is no longer accep…See More"}, "Robert Ward": {"text": "I'm not going to defend the police. I watched the video. I fully believe if I did the same thing I would have also been shot dead.I do not believe the primary issue behind unjustified use of force is race. If that was true, solutions such as diverse …See More"}, "Jillian Sarkady": {"text": "Even if that is all true, 7 bullets? Isn't it possible they could have shot him to disable rather than kill him. Yes it is coming from the same mindset as those officers who unnecessarily sat on George Floyd's back, despite his being completely restrai…See More"}, "Lizzete Quino": {"text": "To bad the same outrage was NOT shown when David Dorn, Dave Patrick Underwood, Vanessa Guillen, and many others were MURDERED. The hypocrisy"}, "Carl L Lane": {"text": "https://medium.com/.../to-be-a-black-male-in-2020-america..."}, "Mina Murray": {"text": "This is why he didn't stop...\"Court records show Blake has a pending criminal case that started last month. Online court records indicate Kenosha County prosecutors charged Blake on July 6 with third-degree sexual assault, trespassing and disorderly conduct in connection with domestic abuse. An arrest warrant was issued for Blake the following day.\"…See More"}, "Jeffrey Andrew Lewis": {"text": "Police have a right to defend themselves and go home at night. At some point your actions have consequences and that is what happened."}}}, {"Post": "", "json_obj": ""}, {"Post": "", "json_obj": ""}, {"Post": "Hello everyone! My name is Suneeti Chambers and I am a freshman at the University of Alabama at Birmingham! I was very fortunate to have participated in debate during some of middle school and all of high school. I was also very lucky to have Lee Quinn, who is the coach of Altamont School Debate, as my coach during my senior year. I am reaching out to everyone here because I am considering starting a collegiate debate team at UAB. I do not expect to have it started by this se...mester, especially with COVID-19, but I would like to start something by this upcoming spring semester. I am considering both policy and parliamentary debate for a possible team at UAB. I understand that there are some things that I have to do through my university, but I would appreciate any assistance with this process. Also, I have no experience with policy or parliamentary debate (only experience with LD and PF), so I need resources on that as well. I would like to also hear from those who have managed and have been a part of collegiate debate to let me know what processes, resources, how much time is involved, etc.. for having a collegiate debate team. As I mentioned earlier, any help or resources would be appreciated! Thank you all for taking the time to read this :)", "json_obj": {"Jamie Davenport": {"text": "Def reach out to Lee and RG! Since Samford and UAB are only like 15 minutes from each other, the team there could be a really good resource. They'd mostly be helpful for policy but 🤷‍♀️ could be good to have someone from a nearby university help vouch for the activity with admin at UAB", "reply": {"Jamie Davenport": {"reply_text": "Suneeti Chambers okay, great! I just wanted to make sure you knew they were there as a resource 👌"}, "Suneeti Chambers": {"reply_text": "Thank you! I already have contacted Dr. Galloway and I have talked to Lee, but I want to give them some space since they're already busy with Samford and Altamont!"}}}, "Mike Janas": {"text": "Samford would love to have another debate team in the neighborhood.  However, UAB already has a world class ethics bowl debate team (they debate about ethics and bioethics).  It is a funded and established program and they are darn good. The easier path might be to hook up with them. https://www.uab.edu/.../student-groups/ethics-bowl-team", "reply": {"Suneeti Chambers": {"reply_text": "Thank you! I will look into this more :)"}}}, "Vik Keenan": {"text": "As college policy debate has moved online for this Fall, it is actually going to be a little easier to do tournament participation as a new program, as questions of travel and many budget costs dont need to be considered. The American Debate Associatio…See More", "reply": {"Suneeti Chambers": {"reply_text": "Thank you for the advice!"}}}, "Joseph A Getto": {"text": "Devon Cantwell know anyone that can help?"}, "Dale Hample": {"text": "If you set this to share I may be able to help"}}}, {"Post": "Just super freaking ridiculous.. 😂 He is such a criminal.. Our pretend mafia \"president\" and his team of evil merry men. 😅🤣", "json_obj": {"Kristina Mercado Kaeding": {"text": "They don't call it the Trump Organization for nothing!"}}}, {"Post": "", "json_obj": ""}, {"Post": "Another tough few days for Law Enforcement. They continue to need our support now more than ever. The incident in Wisconsin could have been avoided for many reasons, but unfortunately the suspect chose the path it went. Two things are for certain: 1) Be sure to thank an officer if given the opportunity and 2) Due to being paralyzed this animal (yes a rapist is an animal) will no longer be able to Rape women and continue his Domestic Violence ways. Facts • Known DV Abuser  • K...nown Rapist • Had warrant for Sexual Assault • Law Enforcement gave him several opportunities to stop and obey orders while he walked back to vehicle • Had track record of scuffling w/police • Had a knife and was retreating to vehicle to possibly get gun      All that and police are still getting blamed for doing their job and people feel bad for this animal who was a women beater and Rapist 🤦🏻‍♂️ Hell of a time to be alive", "json_obj": {"Kyle Cain-Rowan": {"text": "I just moved here and this group is worse than snohomish county😂🤦🏼‍♂️"}, "Amy Nightingale Hurst": {"text": "As a law enforcement wife I appreciate this so much"}, "Jamie Sturgill": {"text": "Thank you. 💙"}}}, {"Post": "Few nations elicit such fatalism among American policymakers and analysts as Vladimir Putin’s Russia, Victoria Nuland writes. But it is still possible to reorient U.S. Russia policy and avoid the mistakes of the past. https://trib.al/pxWGDXa", "json_obj": ""}, {"Post": "You can spread COVID-19 without even knowing you have it. Don’t gamble with the health of the people you care about – wear a mask and keep hangouts small. 😷------😷", "json_obj": ""}, {"Post": "According to QAnon, Donald Trump is working to save us all in a moment called \"The Storm,\" but keeping it under wraps? Full piece: https://on.cc.com/3hA9pes", "json_obj": ""}]